:PROPERTIES:
:header-args:C: :results scalar :exports both :eval none-export
:END:
#+title: C 语言项目案例
*** 通过 socket 链接到服务器
我们通过特定的端口号连接到远程服务器.所以,我们需要两个信息, IP 地址和端口号.

要连接到一个远程服务器,我们需要做几件事情. 首先是创建一个有着正确值的 sockaddr_in
结构.
#+begin_src C
struct sockaddr_in server;
#+end_src
来看看这个结构的组成:
#+begin_src C
// IPv4 AF_INET sockets:
struct sockaddr_in{
  short sin_family;		// e.g. AF_INET, AF_INET6
  unsigned short sin_port;	// e.g. htons(3490)
  struct in_addr sin_addr;	// 参见下面的 in_addr 结构定义
  char sin_zero[8];		// 如果需要,可用来清零的
};

struct in_addr{
  unsigned long s_addr;		// 用 inet_pton() 加载
};

struct sockaddr{
  unsigned short  sa_family;	// 地址族, AF_XXX
  char sa_data[14];		// 14 字节的协议地址
};
#+end_src

sockaddr_in 有一个叫做 sin_addr 的 in_addr 结构类型成员,该类型只包含一个无符号长
整型,该值是 IP 地址的长整型格式.

inet_addr() 函数是一个非常有用的函数,它用来将 IP 地址转换为一个长整型格式.使用示
例:
#+begin_src C
server.sin_addr._s_addr = inet_addr("74.125.235.20");
#+end_src
所以我们需要知道正要连接的远程服务器的 IP 地址. 上面的例子里使用的是
www.google.com 的 IP 地址作为示例,随后我们会介绍如何找到给定域名的 IP 地址.

最后一件事,我们需要的是 connetc() 函数, 该函数需要一个套接字和一个 sockaddr 结构
来连接. 下面是代码示例:
#+begin_src C
#include <stdio.h>
#include <sys/socket.h>
#include <arpa/inet.h> // inet_addr()

int main(int argc, char * argv[]) {

  int socket_desc;
  struct sockaddr_in server;

  /* 创建一个 socket */
  socket_desc = socket(AF_INET, SOCK_STREAM, 0);
  if(socket_desc == -1)
    {
      printf("Could not create socket");
    }

  server.sin_addr.s_addr = inet_addr("14.215.177.39");
  server.sin_family = AF_INET;
  server.sin_port = htons(80);


  /* 连接到服务器 */
  if(connect(socket_desc, (struct sockaddr *)&server, sizeof(server)) < 0)
    {
      puts("Connect error!");
      return 1;
    }
  puts("Connected!");
  return 0;
}
#+end_src

#+RESULTS:
: Connected!

这再简单不过了吧. 上面的代码创建了一个 socket 并且用它建立了连接.当你尝试连接其
他端口号时,你应该不会连接成功,因为这表明了该端口并没有开启用于连接.

现在,我们已经成功连接的服务器,下面,让我们来向服务器发送一些数据.

#+begin_quote
"连接" 这个概念仅仅应用于 SOCK_STREAM/TCP 类型的套接字. 连接意味着可靠的数据流,
这样的数据流可以有多个,每个流都有自己的通信,可以将其视为不受其他数据干扰的管道.

其他的套接字如 UDP, ICMP, ARP 没有 "连接" 的概念, 这些都是基于非连接的通信. 这意
味着不断地发送或接收来自任何人的数据包.
#+end_quote
*** 通过 socket 发送数据
send() 函数可以简单地发送数据. 它需要一个 socket 描述符, 要发送的数据以及数据大
小. 下面是一个非常简单的示例用来向 www.baidu.com 的 IP 地址发送一些数据.
#+begin_src C
#include <stdio.h>
#include <string.h>
#include <sys/socket.h>
#include <arpa/inet.h> // inet_addr

int main(int argc, char * argv[]) {

  int socket_desc;
  struct sockaddr_in server;
  char * message;

  /* 创建一个 socket */
  socket_desc = socket(AF_INET, SOCK_STREAM, 0);
  if(socket_desc == -1)
    {
      printf("Could not create socket");
    }

  server.sin_addr.s_addr = inet_addr("14.215.177.39"); // the IP of www.baidu.com
  server.sin_family = AF_INET;
  server.sin_port = htons(80);


  /* 连接到服务器 */
  if(connect(socket_desc, (struct sockaddr *)&server, sizeof(server)) < 0)
    {
      puts("Connect error!");
      return 1;
    }
  puts("Connected!");


  /* 发送数据 */
  message = "GET / HTTP/1.1\r\n\r\n";
  if(send(socket_desc,message, strlen(message), 0) < 0)
    {
      puts("Send failed!");
      return 1;
    }
  puts("Data Send\n");
  return 0;
}
#+end_src

#+RESULTS:
: Connected!
: Data Send
:

上面的例子里,我们连接到一个 IP 地址,并发送了一个字符串消息 "GET /
HTTP/1.1\r\n\r\n" 到该 IP 代表的服务器.

该消息实际上是一条 http 命令,是用来获取网站的主页用的.

现在,我们向服务器发送了一些数据,是时候接收来自服务器的回应了.

#+begin_quote
当向 socket 发送数据的时候,你基本上就是在向该 socket 写入数据.这和写入文件非常相
似,因此,你也可以使用 write() 函数来向 socket 发送数据. 后面我们会使用 write() 函
数来发送数据.
#+end_quote
*** 从 socket 接收数据
函数 recv() 是用来在 socket 上接收数据的. 下面的例子里,我们会向服务器发送上个例
子里相同的消息,并从服务器接收回复.
#+begin_src C
#include <stdio.h>
#include <string.h>
#include <sys/socket.h>
#include <arpa/inet.h> // inet_addr

int main(int argc, char * argv[]) {

  int socket_desc;
  struct sockaddr_in server;
  char * message, server_reply[2000];

  /* 创建一个 socket */
  socket_desc = socket(AF_INET, SOCK_STREAM, 0);
  if(socket_desc == -1)
    {
      printf("Could not create socket");
    }
  server.sin_addr.s_addr = inet_addr("14.215.177.38");
  server.sin_family = AF_INET;
  server.sin_port = htons(80);


  /* 连接到服务器 */
  if(connect(socket_desc, (struct sockaddr *)&server, sizeof(server)) < 0)
    {
      puts("Connect error!");
      return 1;
    }
  puts("Connected!");


  /* 发送数据 */
  message = "GET / HTTP/1.1\r\n\r\n";
  if(send(socket_desc,message, strlen(message), 0) < 0)
    {
      puts("Send failed!");
      return 1;
    }
  puts("Data Send");

  /* 从服务器接收回复 */
  if(recv(socket_desc, server_reply, sizeof(server_reply),0) < 0)
    {
      puts("Recv failed!");
    }
  puts("Reply received!\n");
  puts(server_reply);
  return 0;
}
#+end_src

#+RESULTS:
#+begin_example
Connected!
Data Send
Reply received!

HTTP/1.1 200 OK
Accept-Ranges: bytes
Cache-Control: no-cache
Connection: keep-alive
Content-Length: 9508
Content-Type: text/html
Date: Fri, 23 Dec 2022 14:20:28 GMT
P3p: CP=" OTI DSP COR IVA OUR IND COM "
P3p: CP=" OTI DSP COR IVA OUR IND COM "
Pragma: no-cache
Server: BWS/1.1
Set-Cookie: BAIDUID=73CAF0920E9800261EB221B691D93EAD:FG=1; expires=Thu, 31-Dec-37 23:55:55 GMT; max-age=2147483647; path=/; domain=.baidu.com
Set-Cookie: BIDUPSID=73CAF0920E9800261EB221B691D93EAD; expires=Thu, 31-Dec-37 23:55:55 GMT; max-age=2147483647; path=/; domain=.baidu.com
Set-Cookie: PSTM=1671805228; expires=Thu, 31-Dec-37 23:55:55 GMT; max-age=2147483647; path=/; domain=.baidu.com
Set-Cookie: BAIDUID=73CAF0920E9800268BCC9A2A6B99B559:FG=1; max-age=31536000; expires=Sat, 23-Dec-23 14:20:28 GMT; domain=.baidu.com; path=/; version=1; comment=bd
Traceid: 167180522802383180907255949292488709478
Vary: Accept-Encoding
X-Frame-Options: sameorigin
X-Ua-Compatible: IE=Edge,chrome=1

<!DOCTYPE html><html><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1"><meta content="always" name="referrer"><meta name="description" content="全球领先的中文搜索引擎、致力于让网民更便捷地获取信息，找到所求。百度超过千亿的中文网页数据库，可以瞬间找到相关的搜索结果。"><link rel="shortcut icon" href="//www.baidu.com/favicon.ico" type="image/x-icon"><link rel="search" type="application/opensearchdescription+xml" href="//www.baidu.com/content-search.xml" title="百度搜索"><title>百度一下，你就知道</title><style type="text/css">body{margin:0;padding:0;text-align:center;background:#fff;height:100%}html{overflow-y:auto;color:#000;overflow:-moz-scrollbars;height:100%}body,input{font-size:12px;font-family:"PingFang SC",Arial,"Microsoft YaHei",sans-serif}a{text-decoration:none}a:hover{text-decoration:underline}img{border:0;-ms-interpolation-mode:bicubic
#+end_example


我们可以看到服务器发送的回复是什么内容. 它看起来像是 HTML, 好吧,它就是
HTML. baidu.com 回复了我们请求的页面的内容. 这很简单吧!

#+begin_quote
当从 socket 接收数据时,我们根本上来讲是从 socket 上读取数据. 这和从文件中读取数
据类似. 所以哦我们也可以使用 read() 函数来从 socket 读取数据. 例如:
#+begin_src C
read(socket_desc, server_reply, 2000);
#+end_src
#+end_quote
*** 获取域名的 IP 地址
当连接到远程主机时,知道它的 IP 地址是很有必要的. 函数 gethostbyname() 就是用来获
取 ip 地址的. 它接收一个域名作为参数,并返回一个 hostent 类型的结构. 这个结构里就
包含了 ip 信息. 该结构的定义位于 netdb.h 头文件. 让我们来看一下这个结构体的组成.
#+begin_src C
/* Description of data base entry for a single host.  */
struct hostent
{
  char *h_name;			/* Official name of host.  */
  char **h_aliases;		/* Alias list.  */
  int h_addrtype;		/* Host address type.  */
  int h_length;			/* Length of address.  */
  char **h_addr_list;		/* List of addresses from name server.  */
};
#+end_src
h_addr_list 里有 IP 地址信息.所以让我们看看如何使用它的示例代码:
#+begin_src C

/* 获取域名对应的 IP 地址 */
#include <netinet/in.h>
#include <stdio.h>
#include <string.h>
#include <sys/socket.h>
#include <netdb.h> // hostent
#include <arpa/inet.h> // inet_addr()

int main(int argc, char * argv[]) {

  char *hostname = "www.baidu.com";
  char ip[100];
  struct hostent *he;
  struct in_addr ** addr_list;
  int i;
  if((he=gethostbyname(hostname)) == NULL)
    {
      herror("gethostbyname");
      return 1;
    }
  addr_list = (struct in_addr **) he -> h_addr_list;
  for(i = 0; addr_list[i] != NULL; i++)
    {
      strcpy(ip , inet_ntoa(*addr_list[i]) );
    }
  printf("%s resolved to: %s", hostname, ip);
  return 0;
}
#+end_src

#+RESULTS:
: www.baidu.com resolved to: 14.215.177.38

上面的代码可以找出任意域名的 IP 地址,然后找到的 IP 地址可以用来通过 socket 建立
连接.

inet_ntoa() 函数会将长整型的 IP 地址转换成点格式(192.168.0.1 这种). 它和
inet_addr() 函数刚好相反.

目前位置,我们已经使用过了一些重要的结构体, 让我们来回顾一下:
+ sockaddr_in :: 连接信息,用于 connect(), send(), recv() 等函数.
+ in_addr :: 长整型格式的 IP 地址信息.
+ sockaddr ::
